In [1]:
import pandas as pd

In [4]:
data = {'Name': ['A', 'B', 'C'], 'Age': [22, 25, 19]}
data

{'Name': ['A', 'B', 'C'], 'Age': [22, 25, 19]}

In [5]:
type(data)

dict

In [6]:
df = pd.DataFrame(data)

In [7]:
print(df)

  Name  Age
0    A   22
1    B   25
2    C   19

In [8]:
type(df)

pandas.core.frame.DataFrame

In [12]:
s = pd.Series([0, 1, 2, 3, 4], index = ['a', 'b', 'c', 'd'])

ValueError: Length of values (5) does not match length of index (4)

In [19]:
s = pd.Series([1, 2, 3, 4, 5], index = ['a', 'b', 'c', 'd', 'e'])

In [21]:
print(s)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [22]:
print(s['c'])

3

In [23]:
print(s[4])

5

In [24]:
import pandas as pd

In [25]:
data = {'Name': ['Ali', 'Jawad', 'Emaan'], 'Marks': [10, 20, 30]}
data

{'Name': ['Ali', 'Jawad', 'Emaan'], 'Marks': [10, 20, 30]}

In [26]:
pf = pd.DataFrame(data)

In [34]:
print(pf)

    Name  Marks
0    Ali     10
1  Jawad     20
2  Emaan     30

In [35]:
print(pf.loc[0])

Name     Ali
Marks     10
Name: 0, dtype: object

In [36]:
print(pf['Name'])

0      Ali
1    Jawad
2    Emaan
Name: Name, dtype: object

In [38]:
print(pf.loc[0])

Name     Ali
Marks     10
Name: 0, dtype: object

In [39]:
print(pf.iloc[0])

Name     Ali
Marks     10
Name: 0, dtype: object

In [40]:
pf['Name']

0      Ali
1    Jawad
2    Emaan
Name: Name, dtype: object

In [41]:
pf['Marks']

0    10
1    20
2    30
Name: Marks, dtype: int64

In [43]:
pf[['Name', 'Marks']]

    Name  Marks
0    Ali     10
1  Jawad     20
2  Emaan     30

In [44]:
pf.loc[0]

Name     Ali
Marks     10
Name: 0, dtype: object

In [45]:
pf.loc[1]

Name     Jawad
Marks       20
Name: 1, dtype: object

In [47]:
pf.loc[[0, 2]]

    Name  Marks
0    Ali     10
2  Emaan     30

In [49]:
pf.loc[0: 2]

    Name  Marks
0    Ali     10
1  Jawad     20
2  Emaan     30

In [50]:
pf.iloc[0:2]

    Name  Marks
0    Ali     10
1  Jawad     20

In [54]:
pf[pf['Marks']>30]

Empty DataFrame
Columns: [Name, Marks]
Index: []

In [55]:
pf.loc[1, 'Name']

'Jawad'

In [56]:
pf.isnull()

    Name  Marks
0  False  False
1  False  False
2  False  False

In [57]:
pf.isnull().sum()

Name     0
Marks    0
dtype: int64

In [61]:
data = pd.DataFrame({'Marks': [1,2,3,4], 'Roll No': [9,8,7,6]})

In [64]:
data['Roll No'] = data['Marks'].astype(float)

In [65]:
data

   Marks  Roll No
0      1      1.0
1      2      2.0
2      3      3.0
3      4      4.0

In [66]:
df = data

In [68]:
a = df.drop_duplicates(inplace=True)

In [70]:
print(a)

None